"""
Diaco MES - Development Settings
=================================
تنظیمات محیط توسعه.
"""
from .base import *

# =============================================================================
# DEBUG
# =============================================================================
DEBUG = True
ALLOWED_HOSTS = ['*']

# =============================================================================
# DEVELOPMENT APPS
# =============================================================================
try:
    import debug_toolbar
    INSTALLED_APPS += ['debug_toolbar']
    MIDDLEWARE.insert(1, 'debug_toolbar.middleware.DebugToolbarMiddleware')
except ImportError:
    pass

INTERNAL_IPS = ['127.0.0.1']

# =============================================================================
# CORS
# =============================================================================
CORS_ALLOW_ALL_ORIGINS = True

# =============================================================================
# EMAIL
# =============================================================================
EMAIL_BACKEND = 'django.core.mail.backends.console.EmailBackend'
